In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel('tips.xlsx')

In [3]:
df.head()

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [4]:
df.tail()

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   gender            244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [15]:
df_pivot1 = df.pivot_table(values="total_bill", index="gender", columns="day", aggfunc="sum")

In [16]:
df_pivot1

day        Fri      Sat      Sun    Thur
gender
Female  127.31   551.05   357.70  534.89
Male    198.57  1227.35  1269.46  561.44

In [17]:
df_pivot2 = df.pivot_table(values="total_bill", index="gender", columns="day", aggfunc=["sum","mean","min"])

In [27]:
df_pivot3 = pd.pivot_table(df,values="total_bill", index="gender", columns="day", aggfunc="mean")

In [19]:
df_pivot2

           sum                                 mean                        \
day        Fri      Sat      Sun    Thur        Fri        Sat        Sun
gender
Female  127.31   551.05   357.70  534.89  14.145556  19.680357  19.872222
Male    198.57  1227.35  1269.46  561.44  19.857000  20.802542  21.887241

                    min
day          Thur   Fri   Sat   Sun  Thur
gender
Female  16.715312  5.75  3.07  9.60  8.35
Male    18.714667  8.58  7.74  7.25  7.51

In [25]:
df_pivot3

day           Fri        Sat        Sun       Thur
gender
Female  14.145556  19.680357  19.872222  16.715312
Male    19.857000  20.802542  21.887241  18.714667

In [38]:
dfpiv1 = pd.pivot_table(df,values='total_bill', index= 'gender', columns = 'smoker', aggfunc=['sum', 'mean', 'min', 'max'])

In [39]:
dfpiv1

            sum                mean              min          max
smoker       No      Yes         No        Yes    No   Yes     No    Yes
gender
Female   977.68   593.27  18.105185  17.977879  7.25  3.07  35.83  44.30
Male    1919.75  1337.07  19.791237  22.284500  7.51  7.25  48.33  50.81

In [42]:
df['smoker']

0       No
1       No
2       No
3       No
4       No
      ...
239     No
240    Yes
241    Yes
242     No
243     No
Name: smoker, Length: 244, dtype: object

In [43]:
df.smoker

0       No
1       No
2       No
3       No
4       No
      ...
239     No
240    Yes
241    Yes
242     No
243     No
Name: smoker, Length: 244, dtype: object

In [46]:
df.shape

(244, 11)

In [51]:
df.total_bill.iloc[201]

np.float64(12.74)

In [52]:
df.total_bill.iloc[[201, 32]]

201    12.74
32     15.06
Name: total_bill, dtype: float64

In [53]:
df.iloc[[201, 32]]

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
201,12.74,2.01,Female,Yes,Thur,Lunch,2,6.37,Abigail Parks,3586645396220590,Thur2544
32,15.06,3.00,Female,No,Sat,Dinner,2,7.53,Amanda Wilson,213186304291560,Sat1327

In [55]:
df.columns

Index(['total_bill', 'tip', 'gender', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [58]:
df.iloc[[201, 32], [0,1]]

     total_bill   tip
201       12.74  2.01
32        15.06  3.00

In [61]:
df.set_index('Payment ID', inplace=True)

In [62]:
df

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [63]:
df.sort_index(inplace=True)

In [72]:
df.reset_index(inplace=True)

In [73]:
df

,Payment ID,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number
0,Fri144,21.01,3.00,Male,Yes,Fri,Dinner,2,10.50,Michael Li,4831801127457917
1,Fri2318,22.75,3.25,Female,No,Fri,Dinner,2,11.38,Jamie Garza,676318332068
2,Fri3159,27.28,4.00,Male,Yes,Fri,Dinner,2,13.64,Eric Carter,4563054452787961
3,Fri3780,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392
4,Fri4106,11.35,2.50,Female,Yes,Fri,Dinner,2,5.68,Lori Lynch,38558279384492
...,...,...,...,...,...,...,...,...,...,...,...
239,Thur9424,22.82,2.18,Male,No,Thur,Lunch,3,7.61,Raymond Torres,4855776744024
240,Thur9501,17.29,2.71,Male,No,Thur,Lunch,2,8.64,Brian Diaz,4759290988169738
241,Thur9593,10.65,1.50,Female,No,Thur,Lunch,2,5.32,Linda Zhang,3560509622598239
242,Thur967,19.81,4.19,Female,Yes,Thur,Lunch,2,9.90,Kristy Boyd,4317015327600068
243,Thur9862,10.34,2.00,Male,Yes,Thur,Lunch,2,5.17,Eric Martin,30442491190342

In [74]:
df.loc[44:50,['total_bill']]

    total_bill
44       28.17
45        3.07
46       17.07
47       21.70
48       22.67
49       12.69
50       22.12

In [78]:
df.pivot_table(values='tip', index= 'smoker', columns='gender', fill_value=0, margins=True, margins_name='Sum', aggfunc='sum')

gender  Female    Male     Sum
smoker
No      149.77  302.00  451.77
Yes      96.74  183.07  279.81
Sum     246.51  485.07  731.58

In [80]:
df['day'] == 'Fri'

0       True
1       True
2       True
3       True
4       True
       ...
239    False
240    False
241    False
242    False
243    False
Name: day, Length: 244, dtype: bool

In [81]:
filt=df['day'] == 'Fri'

In [86]:
df.loc[filt,['day', 'total_bill', 'tip', 'size']]

    day  total_bill   tip  size
0   Fri       21.01  3.00     2
1   Fri       22.75  3.25     2
2   Fri       27.28  4.00     2
3   Fri        5.75  1.00     2
4   Fri       11.35  2.50     2
5   Fri       28.97  3.00     2
6   Fri       12.16  2.20     2
7   Fri       12.46  1.50     2
8   Fri       22.49  3.50     2
9   Fri       13.42  1.58     2
10  Fri       15.98  3.00     3
11  Fri       10.09  2.00     2
12  Fri        8.58  1.92     1
13  Fri       16.27  2.50     2
14  Fri       16.32  4.30     2
15  Fri       13.42  3.48     2
16  Fri       15.38  3.00     2
17  Fri       12.03  1.50     2
18  Fri       40.17  4.73     4

In [89]:
df.pivot_table(values='tip', index ='day', columns='size', aggfunc='mean', margins=True, margins_name='avg', fill_value=0)

size       1         2         3         4         5      6       avg
day
Fri   1.9200  2.644375  3.000000  4.730000  0.000000  0.000  2.734737
Sat   1.0000  2.517547  3.797778  4.123846  3.000000  0.000  2.993103
Sun   0.0000  2.816923  3.120667  4.087778  4.046667  5.000  3.255132
Thur  1.8300  2.442500  2.692500  4.218000  5.000000  5.300  2.771452
avg   1.4375  2.582308  3.393158  4.135405  4.028000  5.225  2.998279

In [91]:
len(df['tip'])

244